export const evalu = {
  1: [
    { label: "1. ความเสียสละและเอาใจใส่ต่อการฝึกปฏิบัติงานวิชาชีพ", value: "p1_1" },
    { label: "2. ความซื่อสัตย์และจรรยาบรรณวิชาชีพ", value: "p1_2" },
    { label: "3. ความเคารพผู้อื่น", value: "p1_3" },
    { label: "4. ความเป็นวิชาชีพ มนุษยธรรม", value: "p1_4" },
    { label: "5. ความใฝ่รู้และความพยายามในการฝีกปฏิบัติงานวิชาชีพ", value: "p1_5" },
    { label: "6. ความรับผิดชอบในการฝึกปฏิบัติงานวิชาชีพ", value: "p1_6" },
    { label: "จุดแข็ง", value: "strength" },
    { label: "จุดที่ต้องปรับปรุง", value: "improvement" },
  ],
  2: [
    { label: "1. ความเสียสละและเอาใจใส่ต่อการฝึกปฏิบัติงานวิชาชีพ", value: "p1_1" },
    { label: "2. ความซื่อสัตย์และจรรยาบรรณวิชาชีพ", value: "p1_2" },
    { label: "3. ความเคารพผู้อื่น", value: "p1_3" },
    { label: "4. ความเป็นวิชาชีพ มนุษยธรรม", value: "p1_4" },
    { label: "5. ความใฝ่รู้และความพยายามในการฝีกปฏิบัติงานวิชาชีพ", value: "p1_5" },
    { label: "6. ความรับผิดชอบในการฝึกปฏิบัติงานวิชาชีพ", value: "p1_6" },
    { label: "จุดแข็ง", value: "strength" },
    { label: "จุดที่ต้องปรับปรุง", value: "improvement" },
  ],
  3: [
    { label: "สถานที่ประเมิน", value: "location" },
    { label: "สถานที่อื่นๆ", value: "locationOther" },
    { label: "บุคลากรที่สื่อสารด้วย", value: "communicator" },
    { label: "บุคลากรอื่นๆ", value: "communicatorOther" },
    { label: "ความยาก/ง่าย", value: "level" },
    { label: "1. ทักษะการสื่อสาร", value: "p1" },
    { label: "2. ความเป็นวิชาชีพ", value: "p2" },
    { label: "3. การตัดสินใจ", value: "p3" },
    { label: "จุดแข็ง", value: "strength" },
    { label: "จุดที่ต้องปรับปรุง", value: "improvement" },
  ],
  // p1	p2	p3	level	location	strength	improvement	communicator	communicatorOther
  4: [
    { label: "สถานที่ประเมิน", value: "location" },
    { label: "บุคลากรที่นิสิต/นักศึกษาสื่อสารด้วย", value: "communicator" },
    { label: "อื่นๆ", value: "communicatorOther" },
    { label: "ความยาก/ง่าย", value: "level" },
    { label: "1. ทักษะการสื่อสาร", value: "p1" },
    { label: "2. ความเป็นวิชาชีพ", value: "p2" },
    { label: "3. การตัดสินใจ", value: "p3" },
    { label: "จุดแข็ง", value: "strength" },
    { label: "จุดที่ต้องปรับปรุง", value: "improvement" },
  ],
  // 5 = p1	p2	p3	p4	p5	p6	p7	p8	p9	p10	strength	improvement
  5: [
    { label: "1. Problem Identification and Prioritization", value: "p1" },
    { label: "2. Subjective Information", value: "p2" },
    { label: "3. Objective Information", value: "p3" },
    { label: "4. Etiology / Cause / Risk factors of problem identified ที่เกี่ยวข้องกับการใช้ยาและการปฏิบัติตัว", value: "p4" },
    { label: "5. Treatment Goals", value: "p5" },
    { label: "6. Assessment of Current Medical Condition(s) หรือ Drug Therapy-related Problem", value: "p6" },
    { label: "7. Treatment Plan", value: "p7" },
    { label: "8. Monitoring & Follow-up", value: "p8" },
    { label: "9. Patient education", value: "p9" },
    {
      label: "10.  วิธีการนําเสนอ", value: "p10" },
    { label: "จุดแข็ง", value: "strength" },
    { label: "จุดที่ต้องปรับปรุง", value: "improvement" },
  ],
   6: [
    { label: "1. Problem Identification and Prioritization", value: "p1" },
    { label: "2. Subjective Information", value: "p2" },
    { label: "3. Objective Information", value: "p3" },
    { label: "4. Etiology / Cause / Risk factors of problem identified ที่เกี่ยวข้องกับการใช้ยาและการปฏิบัติตัว", value: "p4" },
    { label: "5. Treatment Goals", value: "p5" },
    { label: "6. Assessment of Current Medical Condition(s) หรือ Drug Therapy-related Problem", value: "p6" },
    { label: "7. Treatment Plan", value: "p7" },
    { label: "8. Monitoring & Follow-up", value: "p8" },
    { label: "9. Patient education", value: "p9" },
    {
      label: "10.  วิธีการนําเสนอ", value: "p10" },
    { label: "จุดแข็ง", value: "strength" },
    { label: "จุดที่ต้องปรับปรุง", value: "improvement" },
  ],
   7: [
    { label: "1. Problem Identification and Prioritization", value: "p1" },
    { label: "2. Subjective Information", value: "p2" },
    { label: "3. Objective Information", value: "p3" },
    { label: "4. Etiology / Cause / Risk factors of problem identified ที่เกี่ยวข้องกับการใช้ยาและการปฏิบัติตัว", value: "p4" },
    { label: "5. Treatment Goals", value: "p5" },
    { label: "6. Assessment of Current Medical Condition(s) หรือ Drug Therapy-related Problem", value: "p6" },
    { label: "7. Treatment Plan", value: "p7" },
    { label: "8. Monitoring & Follow-up", value: "p8" },
    { label: "9. Patient education", value: "p9" },
    {
      label: "10.  วิธีการนําเสนอ", value: "p10" },
    { label: "จุดแข็ง", value: "strength" },
    { label: "จุดที่ต้องปรับปรุง", value: "improvement" },
  ],
  // 8 = p1	strength	improvement
  8: [
    { label: "1. การปฏิบัติตนตามกฎระเบียบของสถานที่ฝึกปฏิบัติงาน", value: "p1" },
    { label: "จุดแข็ง", value: "strength" },
    { label: "จุดที่ต้องปรับปรุง", value: "improvement" },
  ],
 // 9 p1 =1. การคัดเลือกบทความโดยนิสิต/นักศึกษา	p2 = 2. การประเมินวิพากษ์บทความและการนําไปใช้	p3 = 3. วิธีการนําเสนอ	p4 =4. การตอบคําถาม (เน้นคุณภาพในการตอบมากกว่าปริมาณ)	strength	improvement
  9: [
    { label: "1. การคัดเลือกบทความโดยนิสิต/นักศึกษา", value: "p1" },
    { label: "2. การประเมินวิพากษ์บทความและการนําไปใช้", value: "p2" },
    { label: "3. วิธีการนําเสนอ", value: "p3" },
    { label: "4. การตอบคําถาม (เน้นคุณภาพในการตอบมากกว่าปริมาณ)", value: "p4" },
    { label: "จุดแข็ง", value: "strength" },
    { label: "จุดที่ต้องปรับปรุง", value: "improvement" },
  ],

//10 p1 = 1. การคัดเลือกเรื่องที่นําเสนอโดยนิสิต/นักศึกษา	p2 = 2. เนื้อหาการนําเสนอ	p3 = 3. การใช้หลักฐานทางวิชาการ	p4 = 4. วิธีการนําเสนอ	p5 = 5. การตอบคำถาม (เน้นคุณภาพในการตอบมากกว่า ปริมาณ)	strength	improvement

 10: [
    { label: "1. การคัดเลือกเรื่องที่นําเสนอโดยนิสิต/นักศึกษา", value: "p1" },
    { label: "2. เนื้อหาการนําเสนอ", value: "p2" },
    { label: "3. การใช้หลักฐานทางวิชาการ", value: "p3" },
    { label: "4. วิธีการนําเสนอ", value: "p4" },
    { label: "5. การตอบคำถาม (เน้นคุณภาพในการตอบมากกว่า ปริมาณ)", value: "p5" },
    { label: "จุดแข็ง", value: "strength" },
    { label: "จุดที่ต้องปรับปรุง", value: "improvement" },
  ],
  
//13 p1 = 1. เชื่อมโยงแผนผังระบบงานของโรง พยาบาลกับมาตรฐานสถานพยาบาลในด้านการจัดการระบบยา p2 = 2. ตระหนักถึงปัญหาหรือความเสี่ยงของระบบยาในโรงพยาบาลที่จะส่งผลกระทบต่อความปลอดภัยของผู้ป่วย p3 = 3. วิเคราะห์ถึงรากสาเหตุของปัญหาความไม่ปลอดภัยจากการใช้ยา (Riskidentification : RCA) p4 = 4. วิเคราะห์ถึงผลกระทบของปัญหาความไม่ปลอดภัยจากการใช้ยา (Risk assessment) p5 = 5. สังเคราะห์กระบวนการแก้ไขหรือป้องกันปัญหาที่สอดคล้องกับบริบทของหน่วยงาน (Risk management) p6 = 6. ความเป็นวิชาชีพ (Professionalism) strength improvement

  13: [ 
    { label: "1. เชื่อมโยงแผนผังระบบงานของโรง พยาบาลกับมาตรฐานสถานพยาบาลในด้านการจัดการระบบยา", value: "p1" },
    { label: "2. ตระหนักถึงปัญหาหรือความเสี่ยงของระบบยาในโรงพยาบาลที่จะส่งผลกระทบต่อความปลอดภัยของผู้ป่วย", value: "p2" },
    { label: "3. วิเคราะห์ถึงรากสาเหตุของปัญหาความไม่ปลอดภัยจากการใช้ยา (Riskidentification : RCA)", value: "p3" },
    { label: "4. วิเคราะห์ถึงผลกระทบของปัญหาความไม่ปลอดภัยจากการใช้ยา (Risk assessment)", value: "p4" },
    { label: "5. สังเคราะห์กระบวนการแก้ไขหรือป้องกันปัญหาที่สอดคล้องกับบริบทของหน่วยงาน (Risk management)", value: "p5" },
    { label: "6. ความเป็นวิชาชีพ (Professionalism)", value: "p6" },
    { label: "จุดแข็ง", value: "strength" },
    { label: "จุดที่ต้องปรับปรุง", value: "improvement" },
  ],
  17: [
    { label: "1. การรวบรวมข้อมูลที่เหมาะสม", value: "p1" },
    { label: "2. การระบุสาเหตุปัญหาทางสุขภาพ", value: "p2" },
    { label: "3. ค้นหาและระบุปัญหาจากการได้รับยา", value: "p3" },
    { label: "4. ระบุและจัดลําดับความสําคัญการเกิดอันตรกิริยา", value: "p4" },
    { label: "5. การพิจารณาเปรียบเทียบคัดเลือกยา", value: "p5" },
    { label: "6. ทักษะการจ่ายยา โดยแจ้งชื่อยา", value: "p6" },
    { label: "7. ทักษะการเขียนฉลากยา ฉลากช่วย.", value: "p7" },
    { label: "8. การให้คําแนะนําการปรับเปลี่ยนพฤติกรรมสุขภาพ", value: "p8" },
    { label: "9. การสื่อสารแก่ผู้ป่วย/ผู้รับบริการ", value: "p9" },
    { label: "10. ติดตามและประเมินผลลัพธ์การรักษา", value: "p10" },
    { label: "ข้อเสนอแนะ", value: "suggestion" },
  ],
  // 18  p1	p2	p3	p4	p5	p6	p7	p8	p9	p10	p11	p12	p13	p14	p15 
  
  18: [
    { label: "1. มีคุณธรรม จริยธรรม", value: "p1" },
    { label: "2. ปฏิบัติตามจรรยาบรรณวิชาชีพ กฎหมาย และระเบียบข้อบังคับต่าง ๆ ที่เกี่ยวข้องกับวิชาชีพเภสัชกรรม", value: "p2" },
    { label: "3. มีเจตคติที่ดีต่อการให้บริการเภสัชกรรม", value: "p3" },
    { label: "4. ไม่มีพฤติกรรมที่เสี่ยงต่อการเปิดเผยความลับของผู้ป่วย", value: "p4" },
    { label: "5. ตรงต่อเวลาและมีวินัย", value: "p5" },
    { label: "6. แต่งกายเหมาะสมแสดงถึงความเป็นวิชาชีพเภสัชกรรม", value: "p6" },
    { label: "7. มีสัมมาคารวะ และประพฤติตนเหมาะสมกับกาลเทศะ", value: "p7" },
    { label: "8. มีน้ําใจไม่เพิกเฉยต่อการช่วยเหลือผู้อื่นตามสมควร", value: "p8" },
    { label: "9. บุคลิกภาพเหมาะสม", value: "p9" },
    { label: "10. ตั้งใจและกระตือรือร้นในการฝึกปฏิบัติงาน", value: "p10" },
    { label: "11. รับผิดชอบต่องานที่ได้รับมอบหมาย", value: "p11" },
    { label: "12. การปรับตัวเข้ากับแหล่งฝึก", value: "p12" },
    { label: "13. การทํางานร่วมกับผู้อื่น", value: "p13" },
    { label: "14. การปรับปรุงตนเองต่อข้อเสนอแนะ", value: "p14" },
    { label: "15. โดยรวมนิสิต/นักศึกษา มีทัศคติที่ดีต่อการประกอบวิชาชีพเภสัชกรรมชุมชน", value: "p15" },
    { label: "ข้อเสนอแนะ", value: "suggestion" },
  ],
    // p1_1 p1_2	p2_1	p2_2	p2_3	p2_4  p3	p4	p5	p6
  19: [
    { label: "1.1 ประกอบด้วย CC, HPI, PMH, FH, SH, ALL, MH, PE", value: "p1_1" },
    { label: "1.2 ไม่เปิดเผยความลับของผู้ป่วย เช่น ระบุชื่อ หรือ นําเสนอข้อมูลเวชระเบียน", value: "p1_2" },
    { label: "2.1 ระบุปัญหาเรื่องโรคและยาของผู้ป่วย และการประเมินแยกโรค", value: "p2_1" },
    { label: "2.2 ระบุข้อมูลของผู้ป่วยที่สัมพันธ์กับปัญหา (subjective & objective data)", value: "p2_2" },
    { label: "2.3 การประเมินสาเหตุ", value: "p2_3" },
    { label: "2.4 แผนการแก้ไขปัญหา", value: "p2_4" },
    { label: "3. การใช้หลักฐานทางวิชาการ", value: "p3" },
    { label: "4. การนําเสนอ", value: "p4" },
    { label: "5. การตอบคําถาม", value: "p5" },
    { label: "6. การบูรณาการองค์ความรู้และความเข้าใจภาพรวมของกรณีศึกษา", value: "p6" },
  ],
  //p1	p2	p3	p4
  20: [
    { label: "1. การคัดเลือกบทความโดยนิสิต/นักศึกษา", value: "p1" },
    { label: "2. นิสิต/นักศึกษาสามารถประเมิน", value: "p2" },
    { label: "3. ความคิดเห็นของนิสิต", value: "p3" },
    { label: "4. การนําเสนอ", value: "p4" },
  ],
  // 51 P1 = 1. มีคุณธรรม จริยธรรม  P2 = 2. ปฏิบัติตามจรรยาบรรณวิชาชีพ กฎหมาย และระเบียบข้อบังคับต่าง ๆ ที่เกี่ยวข้องกับวิชาชีพเภสัชกรรม P3 = 3. มีเจตคติที่ดีต่อการให้บริการเภสัชกรรม P4 = 4. ไม่มีพฤติกรรมที่เสี่ยงต่อการเปิดเผยความลับของผู้ป่วย P5 = 5. ตรงต่อเวลาและมีวินัย P6 =


    51: [
    { label: "1. มีคุณธรรม จริยธรรม", value: "p1" },
    { label: "2. ปฏิบัติตามจรรยาบรรณวิชาชีพ กฎหมาย และระเบียบข้อบังคับต่าง ๆ ที่เกี่ยวข้องกับวิชาชีพเภสัชกรรม", value: "p2" },
    { label: "3. มีเจตคติที่ดีต่อการให้บริการเภสัชกรรม", value: "p3" },
    { label: "4. ไม่มีพฤติกรรมที่เสี่ยงต่อการเปิดเผยความลับของผู้ป่วย", value: "p4" },
    { label: "5. ตรงต่อเวลาและมีวินัย", value: "p5" },
    { label: "6. แต่งกายเหมาะสมแสดงถึงความเป็นวิชาชีพเภสัชกรรม", value: "p6" },
    { label: "7. มีสัมมาคารวะ และประพฤติตนเหมาะสมกับกาลเทศะ", value: "p7" },
    { label: "8. มีน้ําใจไม่เพิกเฉยต่อการช่วยเหลือผู้อื่นตามสมควร", value: "p8" },
    { label: "9. บุคลิกภาพเหมาะสม", value: "p9" },
    { label: "10. ตั้งใจและกระตือรือร้นในการฝึกปฏิบัติงาน", value: "p10" },
    { label: "11. รับผิดชอบต่องานที่ได้รับมอบหมาย", value: "p11" },
    { label: "12. การปรับตัวเข้ากับแหล่งฝึก", value: "p12" },
    { label: "13. การทํางานร่วมกับผู้อื่น", value: "p13" },
    { label: "14. การปรับปรุงตนเองต่อข้อเสนอแนะ", value: "p14" },
    { label: "15. โดยรวมนิสิต/นักศึกษา มีทัศคติที่ดีต่อการประกอบวิชาชีพเภสัชกรรมชุมชน", value: "p15" },
    { label: "ข้อเสนอแนะ", value: "suggestion" },
  ],
  // 52 P1 = 1. การรวบรวมข้อมูลที่เหมาะสม  P2 = 2. การระบุสาเหตุปัญหาทางสุขภาพ P3 = 3. ค้นหาและระบุปัญหาจากการได้รับยา P4 = 4. ระบุและจัดลําดับความสําคัญการเกิดอันตรกิริยา P5 = 5. การพิจารณาเปรียบเทียบคัดเลือกยา P6 = 6. ทักษะการจ่ายยา โดยแจ้งชื่อยา  P7 =7. ทักษะการเขียนฉลากยา ฉลากช่วย.  P8 = 8. การให้คําแนะนําการปรับเปลี่ยนพฤติกรรมสุขภาพ  P9 = 9. การสื่อสารแก่ผู้ป่วย/ผู้รับบริการ P10 10. ติดตามและประเมินผลลัพธ์การรักษา suggestion = ข้อเสนอแนะ

  52: [
    { label: "1. การรวบรวมข้อมูลที่เหมาะสม", value: "p1" },
    { label: "2. การระบุสาเหตุปัญหาทางสุขภาพ", value: "p2" },
    { label: "3. ค้นหาและระบุปัญหาจากการได้รับยา", value: "p3" },
    { label: "4. ระบุและจัดลําดับความสําคัญการเกิดอันตรกิริยา", value: "p4" },
    { label: "5. การพิจารณาเปรียบเทียบคัดเลือกยา", value: "p5" },
    { label: "6. ทักษะการจ่ายยา โดยแจ้งชื่อยา", value: "p6" },
    { label: "7. ทักษะการเขียนฉลากยา ฉลากช่วย.", value: "p7" },
    { label: "8. การให้คําแนะนําการปรับเปลี่ยนพฤติกรรมสุขภาพ", value: "p8" },
    { label: "9. การสื่อสารแก่ผู้ป่วย/ผู้รับบริการ", value: "p9" },
    { label: "10. ติดตามและประเมินผลลัพธ์การรักษา", value: "p10" },
    { label: "ข้อเสนอแนะ", value: "suggestion" },
  ],
 // 22 p1	p2	p3	p3_1	p3_2	p3_3
  22: [
    { label: "1. พฤติกรรมและการปฏิบัติตนของนักศึกษา (10 คะแนน)", value: "p1" },
    { label: "2. ทักษะการเรียนรู้ด้วยตนเอง เช่น การประเมินจากการทำแบบกิจกรรมในคู่มือ การส่งงานสม่ำเสมอ ความกระตือรือร้นในการเรียนรู้ (20 คะแนน)", value: "p2" },
    { label: "3. ความรู้และทักษะในการฝึกปฏิบัติงาน (70 คะแนน)", value: "p3" },
    { label: "- ความรู้และทักษะการปฏิบัติงานระดับบุคคล (30)", value: "p3_1" },
    { label: "- ความรู้และทักษะการปฏิบัติงานระดับครอบครัว (20)", value: "p3_2" },
    { label: "- ความรู้และทักษะการปฏิบัติงานระดับชุมชน (20)", value: "p3_3" },
  ],

// 29 p1	p2	p3	p4	p5	p6	p7	p8	p9	p10 
  29: [
    { label: "1. การตรงต่อเวลาการมีวินัยและปฏิบัติตนตามแหล่งฝึก", value: "p1" },
    { label: "2. การแต่งกายเหมาะสม แสดงถึงความเป็นวิชาชีพเภสัชกรรม", value: "p2" },
    { label: "3. การปรับตัวเข้ากับแหล่งฝึกและการปรับปรุงตนเองต่อข้อเสนอแนะ", value: "p3" },
    { label: "4. การมีมนุษยสัมพันธ์ที่ดี สามารถติดต่อกับผู้อื่นได้อย่างเหมาะสม มีมารยาทในการปฏิบัติงานที่ดี", value: "p4" },
    { label: "5. ความมีน้ำใจ ไม่เพิกเฉยต่อการช่วยเหลือผู้อื่น", value: "p5" },
    { label: "6. การเตรียมความพร้อมก่อนฝึกปฏิบัติงาน", value: "p6" },
    { label: "7. ความตั้งใจ กระตือรือร้น และความรับผิดชอบต่องานที่ได้รับมอบหมาย", value: "p7" },
    { label: "8. ความซื่อสัตย์สุจริต และการรักษาไว้ซึ่งจรรยาบรรณแห่งวิชาชีพ", value: "p8" },
    { label: "9. ความคิดริเริ่มสร้างสรรค์", value: "p9" },
    { label: "10. การแสดงความคิดเห็น และทักษะในการสื่อสาร", value: "p10" },
    { label: "ข้อเสนอแนะ", value: "suggestion" },
  ],




}
